# -*- encoding=utf8 -*-

from emoji import UNICODE_EMOJI

FACE_BY_NAMES = ['加油必胜', '加油抱抱', '口罩护体', '搬砖中', '忙到飞起', '脑阔疼', '沧桑', '捂脸',
                 '辣眼睛', '哦哟', '头秃', '问号脸', '暗中观察', 'emm', '吃瓜', '呵呵哒', '我酸了', '太南了',
                 '头撞击', '甩头', '扔狗', '糊脸', '偷看', '拍桌', '啵啵', '喷脸', '拍头', '舔一舔', '干杯',
                 '扇脸', '蹭一蹭', '撩一撩', '哼', '掐一掐', '顶呱呱', '抱抱', '原谅', '佛系', '拽炸天', '颤抖',
                 '生日快乐', '嘲讽', '开枪', '啃头', '恭喜', '惊呆', '暴击', '拍手']

FACE_NAMES = ['微笑', '撇嘴', '色', '发呆', '得意', '流泪', '害羞', '闭嘴', '睡', '大哭', '尴尬', '发怒',
              '调皮', '呲牙', '惊讶', '难过', '酷', '冷汗', '抓狂', '吐', '偷笑', '可爱', '白眼', '傲慢',
              '饥饿', '困', '惊恐', '流汗', '憨笑', '悠闲', '奋斗', '咒骂', '疑问', '嘘...', '晕', '折磨',
              '衰', '骷髅', '敲打', '再见', '擦汗', '抠鼻', '鼓掌', '糗大了', '坏笑', '左哼哼', '右哼哼',
              '哈欠', '鄙视', '委屈', '快哭了', '阴险', '亲亲', '吓', '可怜', '菜刀', '西瓜', '啤酒', '篮球',
              '乒乓', '咖啡', '饭', '猪头', '玫瑰', '凋谢', '示爱', '爱心', '心碎', '蛋糕', '闪电', '炸弹', 
              '刀', '足球', '瓢虫', '便便', '月亮', '太阳', '礼物', '拥抱', '赞', '踩', '握手', '胜利', 
              '抱拳', '勾引', '拳头', '差劲', '爱你', 'NO', 'OK', '爱情', '飞吻', '跳跳', '发抖', '怄火', 
              '转圈', '磕头', '回头', '跳绳', '挥手', '激动', '街舞', '献吻', '左太极', '右太极', '双喜', 
              '鞭炮', '灯笼', '发财', 'K歌', '购物', '邮件', '帅', '喝彩', '祈祷', '爆筋', '棒棒糖', '喝奶', 
              '下面', '香蕉', '飞机', '开车', '高铁左车头', '车厢', '高铁右车头', '多云', '下雨', '钞票', 
              '熊猫', '灯泡', '风车', '闹钟', '打伞', '彩球', '钻戒', '沙发', '纸巾', '药', '手枪', '青蛙']

